# YOLOv8n + BiFPN 3x (EfficientDet-D0 Compliant)
nc: 80
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 1-P2/4  
  - [-1, 3, C2f, [128, True]]                    # 2
  - [-1, 1, Conv, [256, 3, 2]]                   # 3-P3/8
  - [-1, 6, C2f, [256, True]]                    # 4 - P3 (256 channels)
  - [-1, 1, Conv, [512, 3, 2]]                   # 5-P4/16
  - [-1, 6, C2f, [512, True]]                    # 6 - P4 (512 channels)
  - [-1, 1, Conv, [1024, 3, 2]]                  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]                   # 8 - P5 (1024 channels)
  - [-1, 1, SPPF, [1024, 5]]                     # 9

head:
  # ✅ BiFPN 3 Layers dengan 64 channels - SESUAI EfficientDet-D0
  - [[4, 6, 8], 1, BiFPN, [64, 3]]               # 10
  
  # Detect head dari output BiFPN [P3, P4, P5]
  - [[10, 0], 1, Detect, [nc]]                   # Detect(P3, P4, P5)