# Ultralytics YOLOv8 dengan BiFPN asli (P3,P4,P5)
nc: 80
scales:
n: [0.33, 0.25, 1024]
s: [0.33, 0.50, 1024]
m: [0.67, 0.75, 768]
l: [1.00, 1.00, 512]
x: [1.00, 1.25, 512]


backbone:
- [-1, 1, Conv, [64, 3, 2]]
- [-1, 1, Conv, [128, 3, 2]]
- [-1, 3, C2f, [128, True]]
- [-1, 1, Conv, [256, 3, 2]] # P3
- [-1, 6, C2f, [256, True]]
- [-1, 1, Conv, [512, 3, 2]] # P4
- [-1, 6, C2f, [512, True]]
- [-1, 1, Conv, [1024, 3, 2]] # P5
- [-1, 3, C2f, [1024, True]]
- [-1, 1, SPPF, [1024, 5]]


head:
# Proyeksi P3,P4,P5 ke channel yang sama sebelum masuk BiFPN
- [4, 1, Conv, [256, 1, 1]] # proj P3
- [6, 1, Conv, [256, 1, 1]] # proj P4
- [9, 1, Conv, [256, 1, 1]] # proj P5


- [[10,11,12], 1, BiFPN, [256, 2]] # dua lapis BiFPN


# hasil BiFPN keluar sebagai 3 fitur P3',P4',P5'
- [13, 1, Identity, []] # P3'
- [13, 1, Identity, []] # P4'
- [13, 1, Identity, []] # P5'


- [[14,15,16], 1, Detect, [nc]]