# Ultralytics YOLOv8 dengan BiFPN asli (P3,P4,P5)
nc: 80
scales:
n: [0.33, 0.25, 1024]



# -----------------------------------
# Backbone
# -----------------------------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]   # P3
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]   # P4
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # P5
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

# -----------------------------------
# Head
# -----------------------------------
head:
  - [4, 1, Conv, [256, 1, 1]]   # 10  proj P3
  - [6, 1, Conv, [256, 1, 1]]   # 11  proj P4
  - [9, 1, Conv, [256, 1, 1]]   # 12  proj P5

  # BiFPN → produces 3 outputs: 13,14,15
  - [[10,11,12], 1, BiFPN, [256, 2]]

  # Detect from BiFPN's 3 outputs
  - [[13,14,15], 1, Detect, [nc]]
