# YOLOv8 + BiFPN x5 (no CBAM, no P2 detect), Detect stays 3-level

nc: 80
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]     # index 4 -> P3
  - [-1, 6, C2f, [256, True]]

  - [-1, 1, Conv, [512, 3, 2]]     # index 6 -> P4
  - [-1, 6, C2f, [512, True]]

  - [-1, 1, Conv, [1024, 3, 2]]    # index 7
  - [-1, 3, C2f, [1024, True]]     # index 8 -> P5
  - [-1, 1, SPPF, [1024, 5]]       # index 9 (do not use as P5)

head:
  # BiFPN 1: use backbone P3,P4,P5
  - [[4, 6, 8], 1, BiFPN, [256, 1]]

  # BiFPN 2..5: chain from previous BiFPN via [-1]
  - [[-1], 1, BiFPN, [256, 1]]
  - [[-1], 1, BiFPN, [256, 1]]
  - [[-1], 1, BiFPN, [256, 1]]
  - [[-1], 1, BiFPN, [256, 1]]

  # Detect: receives fused [P3,P4,P5] from last BiFPN
  - [[-1], 1, Detect, [nc]]
